## Pandas üêº

<pre><b>Pandas is a Python library which is use to analyze and manipulate the data.
    
It is also use to create and read datasets.
    
Pandas is of two types :
<ul><li>Series(single column)</li>
<li>DataFrame(multiple columns)</li></ul><b><pre>

In [3]:
import pandas as pd

In [5]:
#Creating a Series
s = pd.Series(['a','b','c','d','e'])
s

0    a
1    b
2    c
3    d
4    e
dtype: object

In [7]:
type(s)

pandas.core.series.Series

In [9]:
s1 = pd.Series(['a','b','c','d','e'],index=[10,20,30,40,50])
s1

10    a
20    b
30    c
40    d
50    e
dtype: object

In [11]:
#indexing
s1[40]

'd'

In [13]:
s1[50]

'e'

In [15]:
s1[20::30]

Series([], dtype: object)

In [17]:
s1[1:5:2]

20    b
40    d
dtype: object

In [19]:
#Tuple to Series
t = pd.Series((100,200,300,400))
t

0    100
1    200
2    300
3    400
dtype: int64

In [21]:
#Set to Series
s = pd.Series({1,1,1,3,5,5,5,4})
s

TypeError: 'set' type is unordered

In [55]:
#Dictionry to series
d = pd.Series({'a':1,'b':2,'c':3,'d':4,'e':5})
d

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [35]:
d1 = pd.Series({'a':1,'b':2,'c':3,'d':4,'e':5},index=['f','g','h','i','j'])
d1

f   NaN
g   NaN
h   NaN
i   NaN
j   NaN
dtype: float64

In [37]:
d1 = pd.Series({'a':1,'b':2,'c':3,'d':4,'e':5},index=['f','a','h','b','j'])
d1

f    NaN
a    1.0
h    NaN
b    2.0
j    NaN
dtype: float64

In [63]:
#indexing
d['b']

np.int64(2)

In [61]:
d[1]

C:\Users\USER\AppData\Local\Temp\ipykernel_3180\708413107.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  d[1]

np.int64(2)

In [59]:
#slicing
d[1:5:2]

b    2
d    4
dtype: int64

In [69]:
#DataFrame
d = {'Name':['Shruti','Prabhu','Arunima','Adarsh','Prerna'],
    'Roll':[111,222,333,444,555],
    'Course':['AIML','DA','Python','AIML','C++']}
d

{'Name': ['Shruti', 'Prabhu', 'Arunima', 'Adarsh', 'Prerna'],
 'Roll': [111, 222, 333, 444, 555],
 'Course': ['AIML', 'DA', 'Python', 'AIML', 'C++']}

In [75]:
df = pd.DataFrame(d)
print(df)

      Name  Roll  Course
0   Shruti   111    AIML
1   Prabhu   222      DA
2  Arunima   333  Python
3   Adarsh   444    AIML
4   Prerna   555     C++

In [77]:
df = pd.DataFrame(d)
df

      Name  Roll  Course
0   Shruti   111    AIML
1   Prabhu   222      DA
2  Arunima   333  Python
3   Adarsh   444    AIML
4   Prerna   555     C++

In [79]:
df.Name[2]

'Arunima'

In [81]:
df.Course[3]

'AIML'

In [83]:
df.iloc[::,::]

      Name  Roll  Course
0   Shruti   111    AIML
1   Prabhu   222      DA
2  Arunima   333  Python
3   Adarsh   444    AIML
4   Prerna   555     C++

In [85]:
df.iloc[::,0]

0     Shruti
1     Prabhu
2    Arunima
3     Adarsh
4     Prerna
Name: Name, dtype: object

In [87]:
df.iloc[0::2,::]

      Name  Roll  Course
0   Shruti   111    AIML
2  Arunima   333  Python
4   Prerna   555     C++

In [89]:
df.iloc[::2,::2]

      Name  Course
0   Shruti    AIML
2  Arunima  Python
4   Prerna     C++

In [91]:
df.loc[::2,::2]

      Name  Course
0   Shruti    AIML
2  Arunima  Python
4   Prerna     C++

In [93]:
#head - it represents top rows
df.head(3)

      Name  Roll  Course
0   Shruti   111    AIML
1   Prabhu   222      DA
2  Arunima   333  Python

In [95]:
#tail - it represents bottom rows (bydefault-5)
df.tail(2)

     Name  Roll Course
3  Adarsh   444   AIML
4  Prerna   555    C++

In [97]:
#rename
df = df.rename(columns={'Name':'Stu_Name'})
df

  Stu_Name  Roll  Course
0   Shruti   111    AIML
1   Prabhu   222      DA
2  Arunima   333  Python
3   Adarsh   444    AIML
4   Prerna   555     C++

In [99]:
#set_index
df.set_index('Roll',inplace=True)
df

     Stu_Name  Course
Roll
111    Shruti    AIML
222    Prabhu      DA
333   Arunima  Python
444    Adarsh    AIML
555    Prerna     C++

In [101]:
df.set_index('Course')
df

     Stu_Name  Course
Roll
111    Shruti    AIML
222    Prabhu      DA
333   Arunima  Python
444    Adarsh    AIML
555    Prerna     C++

In [117]:
import numpy as np

In [147]:
d = pd.DataFrame({'Date':[1,2,3,4,5],
                 'Places':['Puri','Manali','Cuttack',np.nan,'Goa'],
                 'Visitors':[5000,4876,5000,4899,3642]})
d

   Date   Places  Visitors
0     1     Puri      5000
1     2   Manali      4876
2     3  Cuttack      5000
3     4      NaN      4899
4     5      Goa      3642

In [149]:
#to check missing values
d.isnull()

    Date  Places  Visitors
0  False   False     False
1  False   False     False
2  False   False     False
3  False    True     False
4  False   False     False

In [151]:
d.isnull().sum()

Date        0
Places      1
Visitors    0
dtype: int64

In [153]:
#fillna
d.Places.fillna('Puri',inplace=True)
d

C:\Users\USER\AppData\Local\Temp\ipykernel_3180\656463471.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  d.Places.fillna('Puri',inplace=True)

   Date   Places  Visitors
0     1     Puri      5000
1     2   Manali      4876
2     3  Cuttack      5000
3     4     Puri      4899
4     5      Goa      3642

In [155]:
d.dtypes

Date         int64
Places      object
Visitors     int64
dtype: object

In [157]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      5 non-null      int64
 1   Places    5 non-null      object
 2   Visitors  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [159]:
d.Places.unique()

array(['Puri', 'Manali', 'Cuttack', 'Goa'], dtype=object)

In [163]:
d.Visitors.max()

np.int64(5000)

In [165]:
d.Visitors.min()

np.int64(3642)

In [167]:
d.Visitors.std()

np.float64(584.9280297609271)

In [169]:
d.describe()

           Date    Visitors
count  5.000000     5.00000
mean   3.000000  4683.40000
std    1.581139   584.92803
min    1.000000  3642.00000
25%    2.000000  4876.00000
50%    3.000000  4899.00000
75%    4.000000  5000.00000
max    5.000000  5000.00000

In [171]:
d.describe(include='all')

            Date Places    Visitors
count   5.000000      5     5.00000
unique       NaN      4         NaN
top          NaN   Puri         NaN
freq         NaN      2         NaN
mean    3.000000    NaN  4683.40000
std     1.581139    NaN   584.92803
min     1.000000    NaN  3642.00000
25%     2.000000    NaN  4876.00000
50%     3.000000    NaN  4899.00000
75%     4.000000    NaN  5000.00000
max     5.000000    NaN  5000.00000

In [177]:
d.describe(include='O')

       Places
count       5
unique      4
top      Puri
freq        2